phy_test/RadonDB_test_result/test_adjust_args/oltp_insert_16_1024.log
sysbench 1.0.11 (using system LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 1024
Report intermediate results every 3 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 3s ] thds: 1024 tps: 108542.70 qps: 108542.70 (r/w/o: 0.00/108542.70/0.00) lat (ms,95%): 20.74 err/s: 0.00 reconn/s: 0.00
[ 6s ] thds: 1024 tps: 88922.75 qps: 88924.42 (r/w/o: 0.00/88924.42/0.00) lat (ms,95%): 26.20 err/s: 0.00 reconn/s: 0.00
[ 9s ] thds: 1024 tps: 78868.52 qps: 78866.86 (r/w/o: 0.00/78866.86/0.00) lat (ms,95%): 33.12 err/s: 0.00 reconn/s: 0.00
[ 12s ] thds: 1024 tps: 33191.89 qps: 33191.89 (r/w/o: 0.00/33191.89/0.00) lat (ms,95%): 81.48 err/s: 0.00 reconn/s: 0.00
[ 15s ] thds: 1024 tps: 89956.76 qps: 89958.09 (r/w/o: 0.00/89958.09/0.00) lat (ms,95%): 30.26 err/s: 0.00 reconn/s: 0.00
[ 18s ] thds: 1024 tps: 74169.52 qps: 74168.19 (r/w/o: 0.00/74168.19/0.00) lat (ms,95%): 50.11 err/s: 0.00 reconn/s: 0.00
[ 21s ] thds: 1024 tps: 82286.58 qps: 82286.25 (r/w/o: 0.00/82286.25/0.00) lat (ms,95%): 29.19 err/s: 0.00 reconn/s: 0.00
[ 24s ] thds: 1024 tps: 61128.15 qps: 61128.48 (r/w/o: 0.00/61128.48/0.00) lat (ms,95%): 75.82 err/s: 0.00 reconn/s: 0.00
[ 27s ] thds: 1024 tps: 80534.05 qps: 80534.05 (r/w/o: 0.00/80534.05/0.00) lat (ms,95%): 31.94 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 1024 tps: 43909.20 qps: 43909.86 (r/w/o: 0.00/43909.86/0.00) lat (ms,95%): 112.67 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            0
        write:                           2226970
        other:                           0
        total:                           2226970
    transactions:                        2226970 (73811.78 per sec.)
    queries:                             2226970 (73811.78 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          30.1692s
    total number of events:              2226970

Latency (ms):
         min:                                  0.63
         avg:                                 13.80
         max:                                933.65
         95th percentile:                     38.94
         sum:                            30722325.50

Threads fairness:
    events (avg/stddev):           2174.7754/60.64
    execution time (avg/stddev):   30.0023/0.02