phy_test/RadonDB_test_result/test_adjust_args/oltp_insert_16_256.log
sysbench 1.0.11 (using system LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 256
Report intermediate results every 3 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 3s ] thds: 256 tps: 88840.55 qps: 88840.55 (r/w/o: 0.00/88840.55/0.00) lat (ms,95%): 6.79 err/s: 0.00 reconn/s: 0.00
[ 6s ] thds: 256 tps: 76660.65 qps: 76660.65 (r/w/o: 0.00/76660.65/0.00) lat (ms,95%): 8.90 err/s: 0.00 reconn/s: 0.00
[ 9s ] thds: 256 tps: 65627.00 qps: 65627.00 (r/w/o: 0.00/65627.00/0.00) lat (ms,95%): 10.84 err/s: 0.00 reconn/s: 0.00
[ 12s ] thds: 256 tps: 47413.67 qps: 47413.67 (r/w/o: 0.00/47413.67/0.00) lat (ms,95%): 16.12 err/s: 0.00 reconn/s: 0.00
[ 15s ] thds: 256 tps: 22939.61 qps: 22939.61 (r/w/o: 0.00/22939.61/0.00) lat (ms,95%): 29.19 err/s: 0.00 reconn/s: 0.00
[ 18s ] thds: 256 tps: 46290.70 qps: 46290.70 (r/w/o: 0.00/46290.70/0.00) lat (ms,95%): 15.27 err/s: 0.00 reconn/s: 0.00
[ 21s ] thds: 256 tps: 83953.62 qps: 83953.62 (r/w/o: 0.00/83953.62/0.00) lat (ms,95%): 8.13 err/s: 0.00 reconn/s: 0.00
[ 24s ] thds: 256 tps: 58503.94 qps: 58503.94 (r/w/o: 0.00/58503.94/0.00) lat (ms,95%): 12.75 err/s: 0.00 reconn/s: 0.00
[ 27s ] thds: 256 tps: 80841.48 qps: 80842.14 (r/w/o: 0.00/80842.14/0.00) lat (ms,95%): 9.06 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 256 tps: 53619.96 qps: 53619.30 (r/w/o: 0.00/53619.30/0.00) lat (ms,95%): 13.70 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            0
        write:                           1874749
        other:                           0
        total:                           1874749
    transactions:                        1874749 (62375.02 per sec.)
    queries:                             1874749 (62375.02 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          30.0529s
    total number of events:              1874749

Latency (ms):
         min:                                  0.63
         avg:                                  4.10
         max:                                211.49
         95th percentile:                     12.30
         sum:                            7679092.60

Threads fairness:
    events (avg/stddev):           7323.2383/54.18
    execution time (avg/stddev):   29.9965/0.01