phy_test/RadonDB_test_result/test_adjust_args/oltp_insert_16_320.log
sysbench 1.0.11 (using system LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 320
Report intermediate results every 3 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 3s ] thds: 320 tps: 96044.25 qps: 96044.25 (r/w/o: 0.00/96044.25/0.00) lat (ms,95%): 7.70 err/s: 0.00 reconn/s: 0.00
[ 6s ] thds: 320 tps: 76873.28 qps: 76873.28 (r/w/o: 0.00/76873.28/0.00) lat (ms,95%): 11.45 err/s: 0.00 reconn/s: 0.00
[ 9s ] thds: 320 tps: 76656.02 qps: 76656.02 (r/w/o: 0.00/76656.02/0.00) lat (ms,95%): 11.65 err/s: 0.00 reconn/s: 0.00
[ 12s ] thds: 320 tps: 33557.40 qps: 33557.40 (r/w/o: 0.00/33557.40/0.00) lat (ms,95%): 25.74 err/s: 0.00 reconn/s: 0.00
[ 15s ] thds: 320 tps: 30714.39 qps: 30714.39 (r/w/o: 0.00/30714.39/0.00) lat (ms,95%): 25.28 err/s: 0.00 reconn/s: 0.00
[ 18s ] thds: 320 tps: 79709.98 qps: 79709.98 (r/w/o: 0.00/79709.98/0.00) lat (ms,95%): 11.65 err/s: 0.00 reconn/s: 0.00
[ 21s ] thds: 320 tps: 64851.08 qps: 64851.08 (r/w/o: 0.00/64851.08/0.00) lat (ms,95%): 13.70 err/s: 0.00 reconn/s: 0.00
[ 24s ] thds: 320 tps: 85235.09 qps: 85235.09 (r/w/o: 0.00/85235.09/0.00) lat (ms,95%): 9.91 err/s: 0.00 reconn/s: 0.00
[ 27s ] thds: 320 tps: 62613.62 qps: 62613.62 (r/w/o: 0.00/62613.62/0.00) lat (ms,95%): 13.70 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 320 tps: 80965.67 qps: 80965.67 (r/w/o: 0.00/80965.67/0.00) lat (ms,95%): 10.09 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            0
        write:                           2062723
        other:                           0
        total:                           2062723
    transactions:                        2062723 (68604.50 per sec.)
    queries:                             2062723 (68604.50 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          30.0637s
    total number of events:              2062723

Latency (ms):
         min:                                  0.61
         avg:                                  4.65
         max:                                302.76
         95th percentile:                     13.46
         sum:                            9599634.25

Threads fairness:
    events (avg/stddev):           6446.0094/52.13
    execution time (avg/stddev):   29.9989/0.01