phy_test/RadonDB_test_result/test_adjust_args/oltp_insert_16_384.log
sysbench 1.0.11 (using system LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 384
Report intermediate results every 3 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 3s ] thds: 384 tps: 101539.12 qps: 101539.12 (r/w/o: 0.00/101539.12/0.00) lat (ms,95%): 8.28 err/s: 0.00 reconn/s: 0.00
[ 6s ] thds: 384 tps: 74829.84 qps: 74829.84 (r/w/o: 0.00/74829.84/0.00) lat (ms,95%): 13.46 err/s: 0.00 reconn/s: 0.00
[ 9s ] thds: 384 tps: 82225.93 qps: 82225.93 (r/w/o: 0.00/82225.93/0.00) lat (ms,95%): 12.98 err/s: 0.00 reconn/s: 0.00
[ 12s ] thds: 384 tps: 32546.15 qps: 32546.15 (r/w/o: 0.00/32546.15/0.00) lat (ms,95%): 31.94 err/s: 0.00 reconn/s: 0.00
[ 15s ] thds: 384 tps: 31013.38 qps: 31013.38 (r/w/o: 0.00/31013.38/0.00) lat (ms,95%): 32.53 err/s: 0.00 reconn/s: 0.00
[ 18s ] thds: 384 tps: 98029.87 qps: 98029.87 (r/w/o: 0.00/98029.87/0.00) lat (ms,95%): 9.91 err/s: 0.00 reconn/s: 0.00
[ 21s ] thds: 384 tps: 60611.39 qps: 60611.39 (r/w/o: 0.00/60611.39/0.00) lat (ms,95%): 16.41 err/s: 0.00 reconn/s: 0.00
[ 24s ] thds: 384 tps: 98006.96 qps: 98006.96 (r/w/o: 0.00/98006.96/0.00) lat (ms,95%): 9.73 err/s: 0.00 reconn/s: 0.00
[ 27s ] thds: 384 tps: 56782.00 qps: 56782.00 (r/w/o: 0.00/56782.00/0.00) lat (ms,95%): 18.61 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 384 tps: 90244.27 qps: 90244.27 (r/w/o: 0.00/90244.27/0.00) lat (ms,95%): 11.45 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            0
        write:                           2178352
        other:                           0
        total:                           2178352
    transactions:                        2178352 (72428.22 per sec.)
    queries:                             2178352 (72428.22 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          30.0731s
    total number of events:              2178352

Latency (ms):
         min:                                  0.61
         avg:                                  5.29
         max:                                244.28
         95th percentile:                     15.00
         sum:                            11518438.05

Threads fairness:
    events (avg/stddev):           5672.7917/51.09
    execution time (avg/stddev):   29.9959/0.01