phy_test/RadonDB_test_result/test_adjust_args/oltp_insert_16_768.log
sysbench 1.0.11 (using system LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 768
Report intermediate results every 3 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 3s ] thds: 768 tps: 107510.21 qps: 107510.21 (r/w/o: 0.00/107510.21/0.00) lat (ms,95%): 16.41 err/s: 0.00 reconn/s: 0.00
[ 6s ] thds: 768 tps: 83552.97 qps: 83552.97 (r/w/o: 0.00/83552.97/0.00) lat (ms,95%): 23.10 err/s: 0.00 reconn/s: 0.00
[ 9s ] thds: 768 tps: 80929.51 qps: 80929.51 (r/w/o: 0.00/80929.51/0.00) lat (ms,95%): 23.95 err/s: 0.00 reconn/s: 0.00
[ 12s ] thds: 768 tps: 30793.22 qps: 30793.22 (r/w/o: 0.00/30793.22/0.00) lat (ms,95%): 70.55 err/s: 0.00 reconn/s: 0.00
[ 15s ] thds: 768 tps: 76509.73 qps: 76509.73 (r/w/o: 0.00/76509.73/0.00) lat (ms,95%): 28.16 err/s: 0.00 reconn/s: 0.00
[ 18s ] thds: 768 tps: 71060.11 qps: 71060.44 (r/w/o: 0.00/71060.44/0.00) lat (ms,95%): 31.37 err/s: 0.00 reconn/s: 0.00
[ 21s ] thds: 768 tps: 98952.85 qps: 98952.52 (r/w/o: 0.00/98952.52/0.00) lat (ms,95%): 19.65 err/s: 0.00 reconn/s: 0.00
[ 24s ] thds: 768 tps: 64024.02 qps: 64024.02 (r/w/o: 0.00/64024.02/0.00) lat (ms,95%): 44.17 err/s: 0.00 reconn/s: 0.00
[ 27s ] thds: 768 tps: 92005.04 qps: 92005.37 (r/w/o: 0.00/92005.37/0.00) lat (ms,95%): 23.10 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 768 tps: 33570.36 qps: 33570.03 (r/w/o: 0.00/33570.03/0.00) lat (ms,95%): 134.90 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            0
        write:                           2217938
        other:                           0
        total:                           2217938
    transactions:                        2217938 (73601.74 per sec.)
    queries:                             2217938 (73601.74 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          30.1301s
    total number of events:              2217938

Latency (ms):
         min:                                  0.62
         avg:                                 10.39
         max:                                936.59
         95th percentile:                     27.66
         sum:                            23044318.92

Threads fairness:
    events (avg/stddev):           2887.9401/52.57
    execution time (avg/stddev):   30.0056/0.01